trade_exp/src/Catalogs/Отделы/Отделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="185e8ada-3ead-4fe0-ba9f-7aa6f38fdec9">
  <name>Отделы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="11e387f3-54db-4496-ad7b-06da8f792e73">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f190465-8417-419b-8aba-b08c44f1381c">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a83eb5ec-5c8c-4666-ab48-1906e7d68823">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29965ef5-fb06-4b3d-9add-ecdd687031a0">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5f9d143-4a06-49e2-bb8d-855ab3318513">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8de732e-42ad-4635-a3a9-c2528b778cad">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9344b6ff-f02a-4c5b-ad60-a91807edf87e">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df94b4fc-8646-43ca-b344-fb1a1ce8f0f2">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="388216eb-779b-43cf-af83-f29c6389729f">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7181374d-e109-40a4-abc7-b447da5d30f4">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ddfb0-40cb-4323-9382-c3a57c6241b1">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fb68ed7-b552-4957-a4a7-308c80a4b197">
    <name>ИдентификаторАстерикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eaff3ee1-6abe-4021-b5fe-b1484b94e6d0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da752511-61de-4f01-a166-216839c92e11">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f6d87ce-cb27-41e1-a72f-e5290739fc24">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c64d903-4c47-4645-aa2a-dc29f8918424">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1111ed8c-d901-4d0e-8970-a72ac74d223d">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Отделы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("АдминистрированиеПропускнойСистемы") ИЛИ РольДоступна("ПолныеПрава") Тогда
		Элементы.СКУД.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры 



&НаСервереБезКонтекста
Функция ЕстьДублиПоСекциям(Секция,Ссылка)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Отделы.Ссылка КАК Ссылка,
		|	Отделы.Секция.Владелец КАК Склад
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|ГДЕ
		|	Отделы.Секция = &Секция
		|	И НЕ Отделы.ПометкаУдаления
		|	И Отделы.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Секция", Секция); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	  Результат.Добавить(Новый Структура("Склад,Ссылка",Выборка.Склад,Выборка.Ссылка));
  	КонецЦикла;   
  
  Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)        
Если ЗначениеЗаполнено(Объект.Секция) Тогда	
	РезультатПроверки = ЕстьДублиПоСекциям(Объект.Секция,Объект.Ссылка);
	Если РезультатПроверки.Количество() > 0 Тогда 
		Отказ = Истина;
		Для Каждого Элемент Из РезультатПроверки Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Запись не возможна!!!! В справочнике уже есть отдел с секцией: %1 (%2)",Объект.Секция,Элемент.Склад);
			Сообщение.КлючДанных = Элемент.Ссылка;
			Сообщение.Сообщить(); 
		КонецЦикла;
	КонецЕсли;  
КонецЕсли;
   
 ЗначениеЗаполнено(Объект.Подразделение);

Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
	Отказ = Истина;          
	Сообщить("Не заполнено Подразделение"); 
КонецЕсли;	
КонецПроцедуры
